CLIENT_CHOICES = [
    ('SMTL', 'АО "Самотлорнефтегаз"'),
    ('SKNG', 'ООО "Севкомнефтегаз"'),
    ('UVAT', 'ООО "РН-Уватнефтегаз"'),
    ('SBNG', 'АО "Сибнефтегаз"'),
    ('UDMR', 'ПАО "Удмуртнефть"'),
    ('TUNG', 'ООО "Тасс-Юрях Нефтедобыча"'),
    ('UGNG', 'ООО "РН-Юганскнефтегаз"'),
    ('SLAV', 'ООО "Славнефть-Красноярскнефтегаз'),
    ('HRNG', 'ООО "Харампурнефтегаз"'),
    ('RNHA', 'ООО "РН Шельф-Арктика"'),
    ('VOIL', 'ООО "Восток Ойл"'),
    ('PRNG', 'ООО "РН-Пурнефтегаз"'),
    ('VCNG', 'АО "ВЧНГ"'),
    ('KOND', 'АО "НК Конданефть"'),
    ('BNDB', 'ООО "Башнефть-Добыча"'),
    ('VNKR', 'АО "Ванкорнефть"'),
    ('VSNK', 'АО "Востсибнефтегаз"'),
    ('NYAG', 'АО "РН-Няганьнефтегаз"'),
    ('PUR', 'ООО "РН-Пурнефтегаз"'),
    ('BND', 'ООО "Башнефть-Добыча"'),
]


def get_full_choices(first: str, choices: list) -> str:
    """Функция для выдачи полного имени заказчика"""
    for item_tuple in choices:
        if first in item_tuple:
            return item_tuple[1]


WELL_TYPE_CHOICES = [
    ('VNS0', 'ВНС'),
    ('NNS0', 'ННС'),
    ('ZBS0', 'ЗБС'),
    ('BGS0', 'БГС'),
]

NORTH_DIRECTION_CHOICES = [
    ('GRID', 'Картографический'),
    ('TRUE', 'Географический'),
    ('MAGN', 'Магнитный'),
]

WELLBORE_CHOICES = [
    ('PLT0', 'ПЛ'),
    ('PLT1', 'ПЛ1'),
    ('PLT2', 'ПЛ2'),
    ('MAIN', 'Основной ствол'),
    ('BGS0', 'БГС'),
    ('ST01', 'СТ1'),
    ('ST02', 'СТ2'),
    ('ST03', 'СТ3'),
    ('ST04', 'СТ4'),
    ('BS01', 'БС1'),
    ('BS02', 'БС2'),
    ('BS03', 'БС3'),
    ('BS04', 'БС4'),
    ('BS05', 'БС5'),
    ('BS06', 'БС6'),
    ('BS07', 'БС7'),
    ('BS08', 'БС8'),
]

SECTION_CHOICES = [
    ('NAPR', 'Направление'),
    ('COND', 'Кондуктор'),
    ('TRAN', 'Транспорт'),
    ('HRZN', 'Горизонт'),
    ('2KKK', '2КК'),
]

MEMORY_CHOICES = [
    ('RQT1', 'Запрошена'),
    ('RQT2', 'Запрошена повторно'),
    ('RCIV', 'Получена'),
    ('CHEK', 'Проверена'),
    ('NMEM', 'Без памяти'),
    ('NOTR', 'Не предоставлена'),
]

BHA_CHOICES = [
    ('RQT1', 'Запрошена'),
    ('RQT2', 'Запрошена повторно'),
    ('RCIV', 'Получена'),
    ('SLIK', 'Гладкая'),
    ('SAGC', 'SAG посчитан')
]
